Tekla Open API Reference for Tekla Structures 2025
MeshCatalog.SelectClicked Event
 The SelectClicked event is raised when the Select button is clicked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler SelectClicked
Public Event SelectClicked As EventHandler
Value
Type: System.EventHandler
See Also
Reference
MeshCatalog Class
Tekla.Structures.Dialog.UIControls Namespace